In [2]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Using cached mysql_connector_python-8.0.29-cp38-cp38-win_amd64.whl (7.7 MB)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\harshvardhan\appdata\local\programs\python\python38\lib\site-packages (from mysql-connector-python) (3.20.1)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.29
Note: you may need to restart the kernel to use updated packages.

In [31]:
import mysql.connector
import pandas as pd

In [4]:
mydb = mysql.connector.connect(
    host= 'localhost',
    user= 'root',
    passwd= '@Harshv178',
    database= 'company'
)

In [6]:
type(mydb)

mysql.connector.connection_cext.CMySQLConnection

In [7]:
mycursor= mydb.cursor()

In [8]:
type(mycursor)

mysql.connector.cursor_cext.CMySQLCursor

In [16]:
mycursor.execute('SELECT * FROM employee')
data= mycursor.fetchall()

In [17]:
len(data)

12

In [29]:
name_test= []
for i in data:
    name_test.append(i[1])
    name_test.concat(i[2])   
name_test

AttributeError: 'list' object has no attribute 'concat'

In [20]:
# Scraping all the data from employee table of company database

In [21]:
data

[(100, 'David', 'Wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1),
 (101, 'Jan', 'Levinson', datetime.date(1961, 5, 11), 'F', 110000, 100, 1),
 (102, 'Michael', 'Scott', datetime.date(1964, 3, 15), 'M', 75000, 100, 2),
 (103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, 102, 2),
 (104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, 102, 2),
 (105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, 102, 2),
 (106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3),
 (107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3),
 (108, 'Jim', 'Halpert', datetime.date(1978, 10, 1), 'M', 71000, 106, 3),
 (109, 'Oscar', 'Martinez', datetime.date(1968, 2, 19), 'M', 69000, 106, 3),
 (110, 'Kevin', 'Malone', datetime.date(1978, 2, 19), 'M', 69000, 106, 3),
 (111, 'Pam', 'Beesly', datetime.date(1988, 2, 19), 'F', 69000, 106, 3)]

In [35]:
first_name= []
last_name= []
emp_id= []
sex= []
born= []
salary= []
branch_id= []

for i in data:
    first_name.append(i[1])
    last_name.append(i[2])
    emp_id.append(i[0])
    born.append(i[3])
    sex.append(i[4])
    salary.append(i[5])
    branch_id.append(i[6])
    
d= {'first_name':first_name,'last_name':last_name, 
    'emp_id':emp_id, 'born':born ,
    'sex':sex, 'salary':salary, 'branch_id':branch_id
    }
    
df = pd.DataFrame(d)

In [36]:
df

   first_name last_name  emp_id        born sex  salary  branch_id
0       David   Wallace     100  1967-11-17   M  250000        NaN
1         Jan  Levinson     101  1961-05-11   F  110000      100.0
2     Michael     Scott     102  1964-03-15   M   75000      100.0
3      Angela    Martin     103  1971-06-25   F   63000      102.0
4       Kelly    Kapoor     104  1980-02-05   F   55000      102.0
5     Stanley    Hudson     105  1958-02-19   M   69000      102.0
6        Josh    Porter     106  1969-09-05   M   78000      100.0
7        Andy   Bernard     107  1973-07-22   M   65000      106.0
8         Jim   Halpert     108  1978-10-01   M   71000      106.0
9       Oscar  Martinez     109  1968-02-19   M   69000      106.0
10      Kevin    Malone     110  1978-02-19   M   69000      106.0
11        Pam    Beesly     111  1988-02-19   F   69000      106.0